UTAF_Base/requestFiles/BPS_Address_BlacklistValidation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v1.address.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         
         <urn:endUserId>id058127</urn:endUserId>
         
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         
         <urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataBlacklistValidation version="1.4">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id058127</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:countryIso3Code>${Req_countryIso3Code}</urn1:countryIso3Code>
         <urn1:cityCode>${Req_cityCode}</urn1:cityCode>
         <urn1:streetCode>${Req_streetCode}</urn1:streetCode>
         <urn1:houseNbr>${Req_houseNbr}</urn1:houseNbr>
         
         <urn1:houseAlf>${Req_houseAlf}</urn1:houseAlf>
         
         <urn1:floorNbr>${Req_floorNbr}</urn1:floorNbr>
      </urn1:RequestDataBlacklistValidation>
   </soapenv:Body>
</soapenv:Envelope>
